package prj05ArrayHomeWork;

public class ProgramArray {

	public static void main(String[] args) {
		/*Определить класс Массив. Создать методы сортировки: обменная сортировка
(метод пузырька); обменная сортировка «Шейкер-сортировка», сортировка
посредством выбора (метод простого выбора), сортировка вставками:
метод хеширования (сортировка с вычислением адреса), сортировка
вставками (метод простых вставок), сортировка бинарного слияния, сортировка
Шелла (сортировка с убывающим шагом).
		 */

		
		
	}

}
